app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1
---
  def index
    @notes = Note.where(user_id: current_user)

INSERT INTO "notes" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "esta es mi primera nota"], ["content", "esta es mi segunda nota\r\n"], ["user_id", 1], ["created_at", "2015-04-27 09:01:46.013904"], ["updated_at", "2015-04-27 09:01:46.013904"]]
---
  def create
    @note = current_user.notes.build(note_params)

    if @note.save

UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "dude"], ["updated_at", "2015-04-26 10:59:30.203633"], ["id", 2]]
---
  def update
    if @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 3]]
---
  def destroy
    @note.destroy

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 3]]
---
  def find_note
    @note = Note.find(params[:id])